Repository: pypi-data/pypi-mirror-380
Catalog: packages/djangorestframework-jwt-treet/djangorestframework_jwt_treet-1.15.0.tar.gz/djangorestframework_jwt_treet-1.15.0/rest_framework_jwt/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Signature has expired.
fi: Allekirjoitus on vanhentunut.

source: Error decoding signature.
fi: Allekirjoituksen purkaminen epäonnistui.

source: Invalid payload.
fi: Virheellinen hyötykuorma.

source: Invalid signature.
fi: Virheellinen allekirjoitus.

source: User account is disabled.
fi: Käyttäjätunnus on poistettu käytöstä.

source: Invalid Authorization header. No credentials provided.
fi: Virheellinen Authorization-otsikko. Käyttäjätunnukset puuttuvat.

source: Invalid Authorization header. Credentials string should not contain spaces.
fi: Virheellinen Authorization-otsikko. Käyttäjätunnus ei saa sisältää välilyöntejä.

source: Unable to log in with provided credentials.
fi: Sisäänkirjautuminen annetuilla käyttäjätunnuksilla epäonnistui.

source: Must include "{username_field}" and "password".
fi: Täytyy sisältää "{username_field}" ja "password".

source: User doesn't exist.
fi: Käyttäjätunnusta ei ole olemassa.

source: Refresh has expired.
fi: Päivitys on vanhentunut.

source: orig_iat field is required.
fi: orig_iat-kenttä vaaditaan.
