Repository: pypi-data/pypi-mirror-380
Catalog: packages/rer.voltoplugin.search/rer.voltoplugin.search-1.0.2-py3-none-any.whl/rer/voltoplugin/search/locales/*/LC_MESSAGES/rer.voltoplugin.search.po
Languages: it

source: Installs the rer.voltoplugin.search add-on.
it: Installa rer.voltoplugin.search

source: Maximum number of characters in a single word
it: Numero massimo di caratteri in una sincola parola

source: Maximum number of words in search query
it: Numero massimo di parole in una query di ricerca

source: Uninstalls the rer.voltoplugin.search add-on.
it: Disinstalla rer.voltoplugin.search

source: all_sites_label
it: In tutti i siti della Regione (${count})

source: all_types_label
it: Tutti i contenuti

source: available_indexes_help
it: Seleziona quali filtri aggiuntivi mostrare in colonna.

source: available_indexes_label
it: Indici disponibili

source: current_site_label
it: In questo sito web (${count})

source: event_adapter_label
it: Eventi

source: filter_end_label
it: Data di fine

source: filter_event_dates_label
it: Data evento

source: filter_start_label
it: Data di inizio

source: help_max_word_len
it: Imposta la lunghezza massina di ogni singola parola ricercata. Le parole pi√π lunghe di questo limite verranno omesse.

source: help_max_words
it: Imposta il numero massimo di parole da cercare. Le parole in eccesso saranno omesse.

source: rer_volto_search_settings_controlpanel_label
it: RER Search

source: types_grouping_help
it: Compilando questo campo, puoi raggruppare i risultati della ricerca per content-type.

source: types_grouping_label
it: Raggruppamento per tipo

source: what_label
it: Cosa
