Repository: pypi-data/pypi-mirror-380
Catalog: packages/pyams-zfiles/pyams_zfiles-2.6.1-py3-none-any.whl/pyams_zfiles/locales/*/LC_MESSAGES/pyams_zfiles.po
Languages: fr

source: Published version {0}
fr: Version {0} publiée

source: Initialize
fr: Initialiser

source: Draft creation
fr: Brouillon créé

source: Publish
fr: Publier

source: Content published
fr: Contenu publié

source: Archive content
fr: Archiver

source: Content archived
fr: Contenu archivé

source: Create new version
fr: Créer une nouvelle version

source: New version created
fr: Nouvelle version créée

source: Delete version
fr: Supprimer la version

source: Version deleted
fr: Version supprimée

source: ZFiles document workflow
fr: Workflow de la GED ZFiles

source: Unknown state
fr: État inconnu

source: new version created
fr: nouvelle version créée

source: publication refused
fr: publication refusée

source: Document content update
fr: Mise à jour du contenu du document

source: Draft
fr: Brouillon

source: Published
fr: Publié

source: Archived
fr: Archivé

source: Deleted
fr: Supprimé

source: draft created
fr: brouillon créé

source: published
fr: publié

source: archived
fr: archivé

source: Private
fr: Privé

source: Protected
fr: Protégé

source: Document unique identifier
fr: Identifiant unique du document

source: Document title
fr: Libellé du document

source: User friendly name of the document
fr: Libellé utilisateur associé au document

source: Source application name
fr: Application source

source: Name of the application which submitted the document
fr: Nom de l'application ayant soumis le document

source: Document data
fr: Contenu du document

source: This is where document content is stored
fr: Contenu utile du document

source: Document data hash
fr: Hash

source: This unique signature is built using SHA512 algorithm
fr: Signature du contenu du fichier basé sur l'algorithme SHA512

source: Access mode
fr: Mode d'accès

source: Access mode on this document
fr: Mode d'accès au document en lecture

source: Update mode
fr: Mode de mise à jour

source: Update mode on this document
fr: Mode d'accès au document en modification

source: Properties
fr: Propriétés

source: List of free additional properties which can be applied to the document; these properties can't be used for searching
fr: Liste de propriétés additionnelles appliquées au document ; ces propriétés sont libres mais ne sont pas indexées et donc non utilisables pour effectuer des recherches

source: Document tags
fr: Tags

source: List of free additional tags which can be applied to the document; these tags can be used for searching
fr: Liste de tags appliqués au document ; ces tags peuvent être appliqués pour effectuer des recherches

source: Last document updater
fr: Mise à jour

source: Name of the last principal which updated the document
fr: Nom du dernier mandataire ayant mis à jour le document

source: Document creator
fr: Créateur

source: Name of the principal which created the document
fr: Nom du mandataire ayant créé le document

source: Document owner
fr: Propriétaire

source: Name of the principal which is owner of the document
fr: Nom du mandataire propriétaire du document

source: Document readers
fr: Lecteurs

source: Name of principals allowed to read the document
fr: Nom des mandataire autorisés à lire le contenu du document

source: Document managers
fr: Contributeurs

source: Name of principals allowed to update the document
fr: Nom des mandataires autorisés à modifier le document

source: Documents OID prefix
fr: Préfixe des OID

source: Prefix used to identify documents which were created locally (unlike documents which were created into another documents container and synchronized with this container)
fr: Préfixe utilisé pour identifier les documents créés localement ; on peut importer des documents en provenance d'un autre conteneur de documents, à la condition qu'ils utilisent un préfixe différent

source: Access menu from home
fr: Accès depuis l'accueil

source: If 'yes', a menu will be displayed to get access to documents container from site admin home page
fr: Si 'oui', un menu d'accès au conteneur de documents sera affiché depuis la page d'accueil de l'interface d'administration du site

source: Application managers
fr: Gestionnaires de l'application

source: These principals can only manage application properties; documents manager role is required to manage documents!
fr: Ces mandataires peuvent gérer les propriétés de l'application et ses rôles ; ils peuvent également gérer les propriétés des documents, et créer de nouveaux documents au nom d'autres utilisateurs

source: Documents creators
fr: Créateurs de documents

source: These principals will be allowed to create or import new documents
fr: Ces mandataires sont autorisés à créer ou importer de nouveaux documents, en leur nom propre ou au nom d'autres mandataires

source: Documents managers
fr: Gestionnaires de documents

source: These principals will be allowed to manage any document properties
fr: Ces mandataires sont autorisés à gérer les propriétés de tous les documents

source: Documents readers
fr: Lecteurs de documents

source: These principals will be allowed to read any document properties
fr: Ces mandataires sont autorisés à consulter tous les documents

source: Configuration name
fr: Nom de la configuration

source: Unique name of the configuration
fr: Nom unique donné à la configuration

source: Remote XML-RPC endpoint
fr: Point d'accès XML-RPC

source: URL of the remote documents container XML-RPC endpoint used for synchronization
fr: URL du point d'accès XML-RPC du conteneur distant vers lequel doit s'effectuer la synchronisation

source: User name
fr: Code utilisateur

source: Name of the remote user used for synchronization
fr: Nom de l'utilisateur distant utilisé pour la synchronisation

source: Password
fr: Mot de passe

source: Password of the remote user used for synchronization
fr: Mot de passe de l'utilisateur distant

source: Synchronization mode
fr: Mode de synchronisation

source: Synchronization mode used for synchronization
fr: Mode utilisé pour la synchronisation

source: Export mode
fr: Exporter les données vers la GED distante

source: Import mode
fr: Importer les données de la GED distante

source: Enabled configuration
fr: Configuration active

source: If 'no', this configuration will not be usable for synchronization
fr: Si 'non', cette configuration sera désactivée et ne pourra pas être utilisée pour effectuer une synchronisation de documents

source: Configuration users
fr: Synchroniseurs

source: Principals which are granted permission to call this configuration
fr: Liste des mandataires autorisés à utiliser cette configuration

source: Property name
fr: Propriété

source: Name of the property used to create index
fr: Nom de la propriété utilisée pour créer l'index

source: Extractor name
fr: Nom de l'extracteur

source: Unique name of the properties extractor
fr: Nom unique donné à l'extracteur

source: Active extractor?
fr: Extracteur actif ?

source: Uncheck this option to disable this extractor...
fr: Activer/désactiver l'extracteur

source: Name of the property which should be set by this extractor
fr: Nom de la propriété alimentée par cet extracteur

source: Override current value?
fr: Remplacer une valeur existante

source: If 'yes', the property will be extracted even if it is already defined into current document properties
fr: Si 'oui', cet extracteur sera appliqué même si la propriété correspondante existe déjà dans le document

source: Extractor RegEx
fr: Expression rationnelle

source: Regular expression to use to extract property value from document content; if the expression returns several results from the document content, they will be set as a list in document properties
fr: Cette expression rationnelle permet d'identifier les propriétés et leur valeur au sein du contenu du document, et doit être compatible avec la syntaxe du package "re" en Python; si l'expression permet d'extraire plusieurs valeurs du document, elles seront séparées par un caractère ';' au sein du document et pourront être indexées et interrogées séparément

source: Multiline?
fr: Multi-lignes

source: If 'yes', given expression will use RegExp MULTILINE option
fr: Si l'expression recherchée au sein du document peut contenir des sauts de lignes (caractère '\n'), vous devez sélectionner cette option

source: Search for all occurrences?
fr: Chercher toutes les occurrences

source: If 'yes', all occurrences will be extracted; otherwise, only the first occurrence will be extracted
fr: Si 'oui', toutes les occurrences de la propriété trouvées dans le document seront extraites ; dans le cas contraire, seule la première occurrence sera utilisée

source: Selected applications
fr: Applications sélectionnées

source: List of applications for which this extractor should be applied
fr: Liste des applications pour lesquelles cet extracteur doit s'appliquer ; laisser cette sélection vide pour que l'extraction se fasse quelle que soit l'application associée au document

source: Selected properties
fr: Propriétés sélectionnées

source: List of current document properties for which this extractor should be applied; you can define properties using the "name=value" syntax, with a newline between each property
fr: Liste des propriétés initiales du document pour lesquelles cet extracteur doit s'appliquer ; vous pouvez définir ces propriétés sous la forme "nom=valeur", et définir plusieurs propriétés en les séparant par un saut de ligne ; laisser cette zone vide pour que l'extraction se fasse quelle que soit la valeur initiale des propriétés du document

source: Property value
fr: Valeur de la propriété

source: Manage ZFiles application
fr: Gérer l'application ZFiles

source: Synchronize documents
fr: Synchroniser des documents

source: Create new document
fr: Créer un nouveau document

source: Create new document (with specified owner)
fr: Créer un nouveau document (avec un propriétaire spécifique)

source: Manage document
fr: Gérer les documents

source: Read document
fr: Voir les documents

source: ZFiles application manager (role)
fr: Gestionnaire ZFiles (rôle)

source: Documents synchronizer (role)
fr: Synchroniseur de documents (rôle)

source: Documents importer (role)
fr: Importateur de documents (rôle)

source: Document manager (role)
fr: Gestionnaire de document (rôle)

source: Document creator (role)
fr: Créateur de document (rôle)

source: Document owner (role)
fr: Propriétaire de document (rôle)

source: Document reader (role)
fr: Lecteur de document (rôle)

source: PyAMS ZFiles skin
fr: Thème PyAMS ZFiles

source: File name
fr: Nom de fichier

source: Document custom properties
fr: Propriétés du document

source: Document workflow state
fr: Statut du workflow

source: Current document owner
fr: Propriétaire du document

source: Document access mode
fr: Mode d'accès au document

source: Document readers IDs
fr: Liste des lecteurs du document

source: Document update mode
fr: Mode de mise à jour du document

source: Document managers IDs
fr: Liste des gestionnaires du document

source: Document base REST API URL
fr: URl de base de l'API REST du document

source: Absolute URL of document data file
fr: URL absolue d'accès au contenu du document

source: SHA512 hash of document data file
fr: Hash du contenu du fichier au format SHA512

source: Document file size
fr: Taille du fichier

source: Document content type
fr: Type de contenu

source: Document version
fr: Version du document

source: Document creator principal ID
fr: ID du mandataire créateur du document

source: Document creation timestamp
fr: Date et heure de création

source: Last document updater principal ID
fr: ID du dernier mandataire ayant modifié le document

source: Last document update timestamp
fr: Dernière mise à jour

source: Last document status updater principal ID
fr: ID du dernier mandataire ayant modifié le statut du document

source: Last document status update timestamp
fr: Dernier changement de statut

source: Document data in Base64 encoding
fr: Contenu du document encodé en Base64

source: Properties query string
fr: Propriétés du document

source: Document creation dates range
fr: Dates de création

source: Document last modification dates range
fr: Dates de dernière modification du document

source: Document last workflow update dates range
fr: Dates de dernière modification du statut du document

source: Document status
fr: Statut du document

source: Source application
fr: Application source

source: Document file name
fr: Nom du fichier

source: Document creation date
fr: Date de création

source: Workflow action
fr: Action du workflow

source: Cancel
fr: Annuler

source: Action comment
fr: Commentaire lié à cette action

source: Publication comment
fr: Commentaire de publication

source: Archiving comment
fr: Commentaire d'archivage

source: New version comment
fr: Commentaire sur la nouvelle version

source: Deleted version comment
fr: Commentaire sur la suppression

source: Delete definitively
fr: Supprimer définitivement

source: This content was never published and is going to be deleted.<br />If you confirm deletion, it won't be possible to restore it.
fr: Ce document n'a jamais été publié et va être supprimé définitivement.<br />Cette suppression est définitive, il sera impossible de restaurer ce contenu !

source: The content version is going to be definitely deleted.<br />Will only remain the currently published or archived versions.
fr: Cette version de ce contenu va être supprimée.<br />Seules resteront disponibles les autres versions actuellement publiées ou archivées.

source: Search document
fr: Rechercher un document

source: Document OID
fr: OID

source: File hash
fr: Hash

source: Document file hash
fr: Hash du document au format SHA512

source: Document properties; you can set properties names and values using URL encoding, like in "property_name=value1&another_prop=value2"; if you set the same property several times, the property values will be combined with an "or"
fr: Propriétés du document ; vous pouvez indiquer les propriétés et leur valeur avec le même encodage que les paramètres dans les URLs, comme par exemple "property_name=value1&another_prop=value2" ; si vous spécifiez la même propriété plusieurs fois, les valeurs de cette propriété seront combinées avec un opérateur "OU"

source: Document tag; you can enter several tags by separating them with semicolons
fr: Vous pouvez sélectionner plusieurs tags en les séparant avec des points-virgules

source: Workflow state of searched documents
fr: Statut des documents recherchés

source: Creator
fr: Créateur

source: Creation dates
fr: Dates de création

source: Dates at which the document (or one of it's versions) was created; first date is included, second date is excluded
fr: Dates de création du document (ou de l'une de ses versions) ; la première date est incluse, la seconde est exclue

source: Owner
fr: Propriétaire

source: Name of the principal owning the document
fr: Nom du mandataire propriétaire du document

source: Updater
fr: Mise à jour

source: Modification dates
fr: Dates de modification

source: Dates at which the document (or one of it's versions) was modified for the last time; first date is included, second one is excluded
fr: Dates de dernière modification du document (ou de l'une de ses versions) ; la première date est incluse, la seconde est exclue

source: Status updater
fr: Changement de statut

source: Last workflow status updater principal ID
fr: ID du dernier mandataire ayant modifié le statut du document

source: Status update dates
fr: Dates de changement

source: Dates at which the document status (or one of it's versions) was modified for the last time; first date is included, second one is excluded
fr: Dates de dernier changement de statut du document (ou de l'une de ses version) ; la première date est incluse, la seconde est exclue

source: Documents search form
fr: Rechercher un document

source: No selected principal
fr: Aucun mandataire sélectionné

source: Title
fr: Titre

source: State
fr: Statut

source: Creation time
fr: Création

source: Search results
fr: Résultats de la recherche

source: Properties extractors
fr: Extracteurs de propriétés

source: Document properties extractors
fr: Extracteurs de propriétés des documents

source: List of documents properties extractors
fr: Liste des extracteurs de propriétés

source: You can use properties extractors to extract properties from a document content.<br />This option requires a "content extractor", to convert document content into a text representation on which regular expressions will be used to extract new properties; extractors actually exist for text and PDF files.
fr: Vous pouvez utiliser des "extracteurs" afin d'extraire la valeur de certaines propriétés à partir du contenu des fichiers associés aux documents. <br />Cette fonctionnalité nécessite de disposer d'un "extracteur de contenu", qui permet d'extraire le texte contenu dans le fichier afin de pouvoir lui appliquer une expression rationnelle pour en extraire la valeur des propriétés ; des extracteurs sont actuellement disponibles pour les fichiers en texte brut ainsi que pour les fichiers PDF.

source: CLick icon to enable or disable property extractor
fr: Cliquer pour activer ou désactiver cet extracteur

source: This extractor can override an existing property
fr: Cet extracteur peut remplacer une propriété prédéfinie

source: This extractor is multi-lines
fr: Cet extracteur est multi-lignes

source: This extractor can extract several values
fr: Cet extracteur peut extraire plusieurs valeurs

source: This extractor is used only for documents matching selected applications of properties
fr: Cet extracteur ne s'applique qu'aux documents correspondant aux applications ou aux propriétés sélectionnées

source: Add new document property extractor
fr: Ajouter un extracteur de propriétés

source: New property extractor
fr: Nouvel extracteur de propriétés

source: New exctractor properties
fr: Propriétés du nouvel extracteur

source: Property extractor with specified name already exists!
fr: Un extracteur avec le nom indiqué existe déjà !

source: Property extractor: {}
fr: Extracteur de propriété : {}

source: Property extractor properties
fr: Propriétés de l'extracteur

source: Documents properties extractors
fr: Propriétés de l'extracteur de propriétés

source: Test properties extractors
fr: Tester l'extraction des propriétés

source: Document properties extraction test
fr: Test d'extraction des propriétés

source: Extractors test output
fr: Résultat de l'extraction

source: Extracted properties
fr: Propriétés extraites

source: Values of properties extracted for this document
fr: Valeur des propriétés extraites de ce document

source: No property was extracted for this document!
fr: Aucune propriété n'a été extraite de ce document !

source: Documents container
fr: Conteneur de documents

source: Documents container configuration
fr: Configuration du conteneur de documents

source: Base configuration
fr: Configuration de base

source: Document properties
fr: Propriétés du document

source: Click icon to enable or disable configuration
fr: Cliquer pour activer ou désactiver la configuration

source: Users roles
fr: Habilitations

source: Name
fr: Nom de la configuration

source: Target
fr: Point d'accès

source: Synchronizer configurations
fr: Configurations de synchronisation

source: Add configuration
fr: Ajouter une configuration

source: New configuration
fr: Nouvelle configuration de synchronisation

source: New configuration properties
fr: Propriétés de la configuration de synchronisation

source: Documents synchronizer
fr: Synchronisation de documents

source: Provided name is already used!
fr: Le nom de configuration indiqué est déjà utilisé !

source: Configuration properties
fr: Propriétés de la configuration

source: Synchronizer configuration: {}
fr: Configuration de synchronisation : {}

source: Catalog indexes
fr: Indexation des propriétés

source: Catalog properties indexes
fr: Propriétés indexées

source: List of catalog properties indexes
fr: Liste des propriétés indexées dans le catalogue

source: By default, ZFiles is using a single index to reference properties of all documents, which can lead to increase conflict errors if you have many documents which share common properties.<br /> Instead, you can choose to create dedicated catalog indexes for a set of selected properties.
fr: Par défaut, ZFiles utilise un seul index pour référencer l'ensemble des propriétés des documents, ce qui peut conduire à un index potentiellement très volumineux et à des conflits d'écriture plus fréquents lorsque vous indexez simultanément de nombreux documents ayant des propriétés quasi similaires.<br /> Au lieu de cela, vous pouvez décider de créer des index dédiés pour certaines propriétés.

source: **WARNING**: adding or removing property indexes require rebuild of one or two catalog indexes, which can be quite long if you have many documents!
fr: **ATTENTION :** l'ajout ou la suppression de ces propriétés nécessite la mise à jour de deux index (en cas d'ajout) ou d'un seul (en cas de suppression) ce qui peut être très long si vous avez un grand nombre de documents !

source: Documents count
fr: Nb. documents

source: Distinct values
fr: Nb. valeurs

source: Add new catalog property index
fr: Ajouter une propriété

source: New property index
fr: Nouvelle propriété à indexer

source: New index properties
fr: Propriétés du nouvel index

source: Catalog index with specified property name already exists!
fr: Cette propriété est déjà indexée !

source: ZFiles source application checker
fr: Vérification de documents ZFiles

source: Application names
fr: Applications sélectionnées

source: Name of the source application
fr: Sélection des applications émettrices concernées pour extraire la liste des documents correspondant contenus dans la GED

source: SQL engine
fr: Source SQL

source: Name of the registered SQL engine used to extract documents OIDs
fr: Nom de la source de données utilisée pour extraire la liste des identifiants de documents

source: Table name
fr: Nom de la table

source: Name of the table or view containing documents OIDs
fr: Nom de la table ou de la vue contenant la liste des identifiants de documents référencés par les applications sélectionnées

source: Field name
fr: Nom du champ

source: Name of table field containing documents OIDs
fr: Nom du champ au sein de la table ou de la vue sélectionnée contenant la liste des identifiants de documents référencés par les applications sélectionnées

source: Dry run
fr: Tir à blanc

source: If 'no', documents missing from source table will be deleted; otherwise, their OID will only be returned in task execution log
fr: En mode 'tir à blanc', la tâche ne fait que renvoyer un état des lieux avec la liste des identifiants sélectionnés et leur statut dans la GED ; en mode 'normal', les documents stockés en GED qui ne sont plus référencés dans les applications sélectionnées seront supprimés définitivement

source: Verbose output?
fr: Rapport d'exécution détaillé

source: If 'Yes', task execution logs will be filled with more verbose output
fr: Si 'oui', le rapport d'exécution de la tâche contiendra plus d'informations sur les documents traités

source: Source application checker task settings
fr: Paramètres de la source

source: Add ZFiles source application checker task...
fr: Vérification de documents ZFiles
