Repository: pypi-data/pypi-mirror-380
Catalog: packages/imio.schedule/imio.schedule-3.0.1.tar.gz/imio.schedule-3.0.1/src/imio/schedule/locales/*/LC_MESSAGES/imio.schedule.po
Languages: fr

source: is one of the following states
fr: est l'un des états suivants

source: to one of the following states
fr: vers l'un des états suivants

source: Absolute
fr: Absolue

source: Activate recurrency
fr: Tache récurente

source: Additional delay
fr: Délai supplémentaire

source: Additional delay is a tal expression?
fr: Le délai supplémentaire est une expression TAL?

source: Additional delay type
fr: Délai additionnel

source: All
fr: Tous

source: Assigned group
fr: Groupe responsable de la tâche

source: Assigned to
fr: Assigné à

source: Assigned user
fr: Responsable de la tâche

source: AutomatedMacroTask
fr: Macro-tâche configurable

source: AutomatedTask
fr: Tâche configurable

source: Calculation delay
fr: Calcul du délai

source: Calculation delay method
fr: Calcul du délai

source: Change the task owner
fr: Réassigner

source: Close task
fr: Fermer la tâche

source: Color due date in orange if it comes close to X days
fr: Souligner l'échéance en ORANGE quand elle a atteint X jours restants

source: Color due date in red if it comes close to X days
fr: Souligner l'échéance en ROUGE quand elle a atteint X jours restants

source: Confirm
fr: Confirmer

source: Creation
fr: Création

source: Creation conditions
fr: Conditions de création de la tâche

source: Custom marker interfaces for this task.
fr: Interfaces marqueurs

source: Day
fr: Jour

source: Define if the additional delay should be interpreted as a tal expression
fr: Choississez si le délai additionnel doit être interpreté comme une expression TAL

source: Define the calculation method for the additional delay
fr: Choisissez la méthode de calcul du délai aditionnel

source: Doable alone
fr: Réalisable seul

source: Done
fr: Fait

source: Due date
fr: Échéance

source: Enabled
fr: Activé

source: End conditions
fr: Conditions de clôture

source: Ending
fr: Fin

source: Freeze
fr: Gel

source: Freeze conditions
fr: Conditions de gel

source: Friday
fr: Vendredi

source: General informations
fr: Paramètres

source: Installs the imio.schedule add-on.
fr: Installe le produit 'échéancier'

source: Leave empty to disable
fr: Laissez le champ vide pour désactiver le surlignage

source: List of working days
fr: Liste des jours ouvrables

source: MacroTask configuration.
fr: Configuration de macro-tâches

source: MacroTaskConfig
fr: Configuration de macro-tâches

source: Marker interfaces
fr: Interfaces marqueurs

source: Monday
fr: Lundi

source: New owner
fr: Nouveau propriétaire

source: Next Friday
fr: Vendredi suivant

source: Next Monday
fr: Lundi suivant

source: Next Saturday
fr: Samedi suivant

source: Next Sunday
fr: Dimanche suivant

source: Next Thursday
fr: Jeudi suivant

source: Next Tuesday
fr: Mardi suivant

source: Next Wednesday
fr: Mercredi suivant

source: Operator
fr: Opérateur

source: Overrides orange color, leave empty to disable
fr: Outrepasse la couleur orange; laissez le champ vide pour désactiver le surlignage

source: Owner changed
fr: Propriétaire réassigné

source: Previous Friday
fr: Vendredi précédant

source: Previous Monday
fr: Lundi précédant

source: Previous Saturday
fr: Samedi précédant

source: Previous Sunday
fr: Dimanche précédant

source: Previous Thursday
fr: Jeudi précédant

source: Previous Tuesday
fr: Mardi précédant

source: Previous Wednesday
fr: Mercredi précédant

source: Recurrence
fr: Récurrence

source: Recurrence condition
fr: Conditions de récurente

source: Round to week day
fr: Arrondir au jour de la semaine

source: Saturday
fr: Samedi

source: Schedulable Macrotask
fr: Macro tâche configurable

source: Schedulable Task
fr: Tâche configurable

source: Schedule configuration.
fr: Configuration d'échéances

source: ScheduleConfig
fr: Configuration d'échéances

source: Scheduled content type
fr: Type de contenu associé

source: Select creation conditions of the task
fr: Sélectionnez les conditions de création de la tâche

source: Select default group assigned to this task.
fr: Groupe assigné par défaut à cette tâche

source: Select default user assigned to this task.
fr: Choisissez l'utisateur qui sera assigné par défaut à cette tâche

source: Select end conditions of the task.
fr: Sélectionnez les conditions de clôture de la tâche

source: Select freeze conditions of the task.
fr: Sélectionnez les conditions de gel de la tâche

source: Select recurrence conditions of the task.
fr: Choisissez les conditions de récurence pour cette tâche

source: Select start conditions of the task
fr: Sélectionnez les conditions de démarrage de la tâche

source: Select thaw conditions of the task.
fr: Sélectionnez les conditions de dégel de la tâche

source: Select the content type to apply schedule.
fr: Sélectionnez le type de contenu de l'échéancier

source: Select the start date used to compute the due date.
fr: Sélectionnez la date de départ pour la calcul de l'échéance

source: Select the state of the container where the task is automatically created.
fr: Sélectionnez l'état du récipient pour lequel la tâche est automatiquement créée

source: Select the state of the container where the task is automatically started.
fr: Sélectionnez l'état du récipient pour lequel la tâche est automatiquement démarrée

source: Select the state of the container where the task should be recurred
fr: Sélectionnez l'état pour lequel la tâche doit recommencer

source: Select the states of the container where the task is automatically closed.
fr: Sélectionnez les états du récipient pour lequel la tâche est automatiquement clôturée

source: Should pass from actual state
fr: Changer l'état actuel

source: Start
fr: Démarrage

source: Start conditions
fr: Conditions de démarrage

source: Start date
fr: Date de départ

source: Started tasks
fr: Tâches en cours

source: State
fr: L'état

source: Subtask
fr: Sous-tâche

source: Subtasks
fr: Sous-tâches

source: Subtasks dependencies
fr: Réalisation distribuée

source: Sunday
fr: Dimanche

source: Task Closed
fr: Tâche cloturée

source: Task configuration.
fr: Configuration de tâche

source: Task container creation state
fr: État de création de la tâche

source: Task container end states
fr: État(s) de clôture de la tâche

source: Task container freeze states
fr: État(s) de gel de la tâche

source: Task container recurrence states
fr: État(s) de récurrence de la tâche

source: Task container start states
fr: État(s) de démarrage de la tâche

source: Task container thaw states
fr: État(s) de dégel de la tâche

source: TaskConfig
fr: Configuration de tâche

source: Thaw
fr: Dégel

source: Thaw conditions
fr: Conditions de dégel de la tâche

source: The additional delay is not a valid integer
fr: Le délai supplémentaire n'est pas un entier

source: The orange value should be higher than the red one, as it is used as a first warning.
fr: La limite pour l'orange doit être supérieure à la rouge, car l'orange est utilisé comme premier avertissement.

source: This delay is added to the due date of the task.
fr: Délai (jours) supplémentaire additionné à la date d'échéance'

source: Thursday
fr: Jeudi

source: To do
fr: À faire

source: Tuesday
fr: Mardi

source: Warning delay
fr: Délai d'alerte

source: Wednesday
fr: Mercredi

source: Working days
fr: Jour ouvrables

source: and
fr: et

source: display_status
fr: Statut

source: or
fr: ou

source: schedule.assign_current_user
fr: Utilisateur connecté

source: schedule.create_if_all_subtasks_can_be_created
fr: Créer si toutes les sous-tâche sont créables

source: schedule.create_if_subtask_can_be_created
fr: Créer dès qu'une sous-tâche est créable

source: schedule.end_when_due_date_reached
fr: Finir dès que la date d'échéance est atteinte

source: schedule.start_date.creation_date
fr: Date de création du dossier

source: schedule.start_date.subtask_highest_due_date
fr: La plus haute date d'échéance parmi les sous-tâches

source: schedule.start_if_all_subtasks_started
fr: Démarrer si toutes les sous-tâche sont démarrées

source: schedule.start_if_subtask_started
fr: Démarrer dès qu'une sous-tâche est démarrée

source: schedule.test_creation_condition
fr: Condition de création TEST

source: schedule.test_end_condition
fr: Condition de fin TEST

source: schedule.test_start_condition
fr: Condition de démarrage TEST
