Repository: pypi-data/pypi-mirror-380
Catalog: packages/pyams-file/pyams_file-2.4.1.tar.gz/pyams_file-2.4.1/src/pyams_file/locales/*/LC_MESSAGES/pyams_file.po
Languages: fr

source: Default thumbnail
fr: Vignette par défaut

source: Custom selections
fr: Sélections spécifiques

source: Portrait thumbnail
fr: Vignette portrait

source: Square thumbnail
fr: Vignette carrée

source: Panoramic thumbnail
fr: Vignette panoramique

source: Card thumbnail
fr: Vignette format Twitter

source: Banner thumbnail
fr: Bandeau

source: Responsive selections
fr: Sélections responsives

source: Smartphone thumbnail
fr: Smartphone

source: Tablet thumbnail
fr: Tablette

source: Medium screen thumbnail
fr: Écrans moyens

source: Large screen thumbnail
fr: Grands écrans

source: Extra-large screen thumbnail
fr: Très grands écrans

source: Title
fr: Titre

source: Save file as...
fr: Enregistrer sous...

source: Name under which the file will be saved
fr: Nom proposé automatiquement lors de l'enregistrement du fichier

source: Language
fr: Langue

source: File's content language
fr: Langue du contenu du fichier
