Repository: pypi-data/pypi-mirror-380
Catalog: packages/pyams-file-views/pyams_file_views-2.0.6-py3-none-any.whl/pyams_file_views/locales/*/LC_MESSAGES/pyams_file_views.po
Languages: fr

source: File properties
fr: Propriétés

source: Main file properties
fr: Propriétés du fichier

source: Download
fr: Télécharger

source: Download original file
fr: Télécharger le fichier original

source: Image preview
fr: Prévisualisation

source: Rotate image right
fr: Tourner l'image vers la droite

source: Crop image
fr: Recadrer l'image

source: Crop
fr: Recadrer

source: Cancel
fr: Annuler

source: New image selection
fr: Recadrage de l'image

source: You can use this form to crop an image. **Cropping an image will alter the original image, and reset all thumbnails and adaptive selections!**
fr: Vous pouvez utiliser ce formulaire pour recadrer une image. **ATTENTION :** Recadrer une image modifie l'image originale et réinitialise toutes les sélections de vignettes !

source: Select thumbnail
fr: Valider la sélection

source: {} selection
fr: Sélection : {}

source: Image selection
fr: Sélection sur l'image

source: Display all selections
fr: Afficher toutes les sélections

source: Display all image selections
fr: Affichage des sélections de l'image

source: Current image selections
fr: Sélections actuelles de l'image

source: Resize image
fr: Réduire la taille de l'image

source: New image width
fr: Largeur de l'image

source: New image height
fr: Hauteur de l'image

source: Keep aspect ratio
fr: Conserver le ratio

source: Check to keep original image aspect ratio; image will then be resized as large as possible within given limits
fr: Sélectionner cette option pour conserver le ratio hauteur/largeur de l'image d'origine

source: New image size
fr: Nouvelles dimensions de l'image

source: You can use this form to reduce an image size. **Resizing an image will alter the original image, and reset all thumbnails and adaptive selections!**
fr: Vous pouvez utiliser ce formulaire pour modifier la taille d'une image, dans la limite des dimensions de l'image d'origine. **ATTENTION :** Cette opération modifie l'image originale et réinitialise toutes les sélections de vignettes !

source: Edit file content
fr: Editer le fichier

source: File content
fr: Contenu du fichier

source: File content editor
fr: Modification du contenu du fichier

source: Current value:
fr: Type de fichier :

source: Browse...
fr: Parcourir...

source: Delete
fr: À supprimer
