Repository: pypi-data/pypi-mirror-380
Catalog: packages/pretix-nextcloud-products/pretix_nextcloud_products-1.0.1.tar.gz/pretix_nextcloud_products-1.0.1/pretix_nextcloud_products/locale/*/LC_MESSAGES/django.po
Languages: de

source: Nextcloud Products
de: Nextcloud-Produkte

source: Instead of ticket downloads, create share links for Nextcloud
de: Anstatt von Ticket-Downloads Share-Links für Nextcloud generieren

source: Order position
de: Bestellungposition

source: Share expiration
de: Share-Ablaufzeitpunkt

source: Nextcloud path
de: Nextcloud-Pfad

source: Personal download link for {name}
de: Persönlicher Download-Link für {name}

source: Download product
de: Produkt herunterladen

source: Root URL of the Nextcloud instance
de: Root-URL der Nextcloud-Instanz

source: Nextcloud username
de: Nextcloud-Benutzername

source: Username of the Nextcloud user used for creating shares
de: Benutzername des Nextcloud-Benutzers, der zum Erstellen der Shares verwendet wird

source: Nextcloud password
de: Nextcloud-Passwort

source: Password of the Nextcloud user used for creating shares
de: Passwort des Nextcloud-Benutzers, der zum Erstellen der Shares verwendet wird
