Repository: pypi-data/pypi-mirror-380
Catalog: packages/edc-*/edc_*-1.2.0.tar.gz/edc_*-1.2.0/src/edc_*/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Primary Certificate
sw: Cheti cha shule ya msingi

source: Secondary Certificate
sw: Cheti cha shule ya sekondari

source: post-Secondary/Tertiary/College
sw: Shule ya baada ya Sekondari/Shule ya juu/Chuo kikuu

source: Other, specify ...
sw: Nyingine, taja ...

source: Wife/Husband
sw: Mke/Mume

source: Son/Daughter
sw: mtoto wa kiume/kike

source: Son/Daughter-in-law
sw: mkwe wa kike/kiume

source: Grandchild
sw: Mjukuu

source: Parent
sw: Mzazi

source: Parent-in-law
sw: Mkwe

source: Brother/Sister
sw: Kaka/Dada

source: Don't know
sw: Sijui

source: Not applicable
sw: Haihusiki

source: Full time employed
sw: Ajira ya kudumu

source: Regular part time employed
sw: Ajira ya muda

source: Irregular/ occasional/ day worker employment
sw: Ajira ya mara moja moja / ya mara kwa mara /ya siku

source: Non-paid/ voluntary role
sw: Isiyo na malipo / kujitolea

source: Student
sw: mwanafunzi

source: Homemaker
sw: Mama/baba wa nyumbani

source: Unemployed (able to work)
sw: Hajaajiriwa (Anaweza kufanya kazi)

source: Unemployed (unable to work)
sw: Hajaajiriwa (Hawezi kufanya kazi)

source: Never Married (but not co-habiting)
sw: Sijawahi kuolewa/kuoa (wala kuishi kinyumba

source: Co-habiting
sw: Ninaishi kinyumba

source: Currently Married
sw: Kwa Sasa Ameolewa/kaoa

source: Separated/Divorced
sw: Kutengana/Talaka

source: Widowed
sw: Mjane

source: Rent
sw: Kupanga

source: Own themselves
sw: Wanamiliki wenyewe

source: Owned by someone else in family
sw: Inamilikiwa na mtu mwingine katika familia

source: Owned by someone else other than family member
sw: Inamilikiwa na mtu mwingine ambaye siyo mwanafamilia

source: Owned together with someone
sw: Inamilikiwa pamoja na mtu mwingine

source: Piped into dwelling/yard plot
sw: Bomba ndani ya makazi/ uwanja

source: Piped to neighbour
sw: Bomba kwa jirani

source: Public tap/standpipe
sw: Bomba la umma/bomba la kusimama

source: Tube well or borehole
sw: kisima

source: Protected dug well
sw: Kisima kilichojengewa

source: Protected spring
sw: Chemchemi iliyojengewa

source: Rainwater
sw: Maji ya mvua

source: Unprotected dug well
sw: Kisima kilichochimbwa bila kujengewa

source: Unprotected spring
sw: chemchemi isiyojengewa

source: Tanker truck/cart with small tank
sw: magari ya maji tanki kubwa/ndogo

source: Surface water (river etc.)
sw: Maji ya ardhini (mto, dimbwi n.k.)

source: Water on premises (includes water piped to a neighbour)
sw: Maji la nyumbani (pamoja na bomba la maji kwa jirani

source: Less than 30 minutes
sw: Chini ya dakika 30

source: 30 minutes or longer
sw: Dakika 30 au zaidi

source: 1. Flush/pour flush to piped sewer system – private
sw: Choo binafsi cha kuflashi ambacho kimeunganishwa na mfumo wa maji taka

source: 2. Flush/pour flush to septic tank – private
sw: Choo binafsi cha kuflashi ambacho kimeunganishwa na tenki/ shimo la maji taka

source: 3. Flush/pour flush to pit latrine – private
sw: choo binafsi cha kuflash ambacho kinachomwaga maji kwenye shimo la choo

source: 4. Ventilated improved pit (VIP) latrine – private
sw: Choo imara chenye hewa safi

source: 5. Pit latrine with slab – private
sw: Choo binafsi cha shimo lililoboreshwa la uingizaji hewa (VIP)

source: 6. Composting toilet – private
sw: Choo binafsi cha kutengeneza mbolea

source: 7. EcoSan – private
sw: Choo binafsi cha EcoScan

source: 8. Flush/pour flush to piped sewer system – shared
sw: Choo cha pamoja cha kuflashi ambacho kimeunganishwa na mfumo wa maji taka

source: 9. Flush/pour flush to septic tank – shared
sw: Choo cha pamoja cha kuflashi ambacho kimeunganishwa na tenki/ shimo la maji taka

source: 10. Flush/pour flush to pit latrine – shared
sw: Choo cha pamoja cha kuflash ambacho kinachomwaga maji kwenye shimo la choo

source: 11. Ventilated improved pit (VIP) latrine – shared
sw: Choo imara chenye hewa safi

source: 12. Pit latrine with slab – shared
sw: Choo pamoja cha shimo kilichofunikwa

source: 13. Composting toilet – shared
sw: Choo cha pamoja cha kutengeneza mbolea

source: 14. EcoSan – shared
sw: Choo cha pamoja cha EcoScan

source: 15. Flush/pour flush not to sewer/septic tank/pit latrine
sw: Choo cha kuflash kisichokuwa na mfumo maalum wa

source: 16. Pit latrine with slab (non-washable)
sw: Shimo la choo chenye bamba (isiyooshwa)

source: 17. Pit latrine without slab/open pit
sw: Shimo la choo bila bamba/shimo wazi

source: 18. Bucket
sw: ndoo

source: 19. Hanging toilet/hanging latrine
sw: Choo cha kuning'inia/choo cha kuning'inia

source: 20. Open defecation (no facility/bush/field)
sw: Kujisaidia hadharani

source: Thatch, Straw
sw: Nyasi, makuti

source: Mud and poles
sw: Matope na nguzo

source: Tin
sw: Makopo

source: Wood
sw: Mbao

source: Iron sheet
sw: Mabati

source: Tiles
sw: Vigae

source: Cement
sw: Saruji

source: Timber
sw: mbao

source: Bricks with mud
sw: matofali kuchoma ya tope

source: Bricks with cement
sw: matofali ya kuchoma ya saruji

source: Cement blocks
sw: tofali za saruji

source: Stone
sw: mawe

source: Glass
sw: kioo

source: Bags
sw: mifuko

source: Iron/metal
sw: chuma

source: Screens
sw: nyavu

source: No windows
sw: hakuna madirisha

source: Earth, sand
sw: mchanga

source: Dung, wood, planks, palm, bamboo
sw: Kinyesi cha Wanyama,mbao, mitende, mianzi

source: Parquet, polished wood, vinyl, asphalt strips
sw: sakafu ya vipande vya mbao, mbao

source: Ceramic tiles
sw: marumaru/tailizi

source: Carpet
sw: zulia

source: acres
sw: Ekari

source: Electricity
sw: Umeme

source: Paraffin, kerosene or gas lantern
sw: Taa ya chemli inayotumia mafuta ya taa au gesi

source: Firewood
sw: kuni

source: Candle
sw: mshumaa

source: LPG/natural gas/biogas
sw: LPG/gesi asilia/biogesi

source: Kerosene
sw: mafuta ya taa

source: Charcoal
sw: mkaa

source: Coal/lignite, straw/shrubs/grass. agricultural crop, animal dung
sw: Makaa ya mawe/lignite, majani/vichaka/nyasi. mazao ya kilimo, samadi ya wanyama

source: No food cooked in the household
sw: Hakuna chakula kinachopikwa katika kaya

source: Don't want to answer
sw: Sitaki kujibu

source: Very good
sw: nzuri sana

source: Good
sw: nzuri

source: Bad
sw: mbaya

source: Very bad
sw: mbaya sana

source: Is the house you live in rented, owned by you (either on your own, or with someone else), or owned by someone else in your family?
sw: Je, nyumba unayoishi umepanga, inamilikiwa na wewe (iwe peke yako, au na mtu mwingine), au inamilikiwa na mtu mwingine katika familia yako?

source: If the owner [you] were to sell this dwelling today, do you know the approximate value?
sw: Ikiwa mmiliki [wewe] ungeuza nyumba hii leo, ni takribani bei gani (ni kiasi gani cha thamani yake katika Shilingi ya Tanzania)?

source: About how much is it worth?
sw: kuhusu ni thamani gani

source: How many rooms does your dwelling have in total, without counting the bathrooms/ toilets or hallways/passageways?
sw: Je! Nyumba yako ina vyumba vingapi kwa jumla, bila kuhesabu bafu, vyoo au njia za ukumbi/korido?

source: How many rooms are used for sleeping in your dwelling?
sw: Je! ni vyumba vingapi vinatumika kwa ajili ya kulala katika nyumba yako?

source: How many beds does your dwelling have in total?
sw: Je, nyumba yako ina vitanda vingapi kwa jumla?

source: What is the main source of drinking water for the household?
sw: Ni nini chanzo kikuu cha maji ya kunywa kwenye kaya?

source: How long does it take to obtain drinking water?
sw: Inachukua muda gani kupata maji ya kunywa?

source: Note: 'private' (1-7) is a toilet solely used by the household and 'shared' (8-14) is a toilet shared by two or more households.
sw: Ni aina gani ya choo hutumika sana katika kaya yako?

source: What is the major construction material of the roof?
sw: Ni nyenzo gani kuu ya ujenzi wa paa?

source: What is the major construction material of the external wall?
sw: Ni nyenzo gani kuu ya ujenzi wa ukuta wa nje?

source: What is the main material on external windows?
sw: Ni nyenzo gani kuu kwenye madirisha ya nje?

source: What is the major construction material of the floor?
sw: Ni nyenzo gani kuu ya ujenzi wa sakafu?

source: Does your household have electricity?
sw: Je, kaya yako ina umeme?

source: What is the main source of lighting?
sw: Chanzo kikuu cha mwanga ni nini?

source: What type of fuel do you primarily use for cooking?
sw: Je, ni chanzo gani cha nishati unatumia kupikia?

source: Radio
sw: redio

source: Television
sw: televisheni

source: Mobile phone
sw: simu ya mkononi

source: Computer
sw: kompyuta

source: Non-mobile telephone
sw: simu ya mezani

source: Fridge
sw: friji

source: Generator
sw: jenereta

source: Flat iron
sw: pasi

source: Bicycle
sw: baiskeli

source: Boat with a motor
sw: boti yenye motor

source: Large Livestock (e.g. cows, bulls, other cattle, horses, donkeys)
sw: Mifugo Wakubwa (k.m. ng'ombe, mafahali, ng'ombe wengine, farasi, punda)

source: Small animals (goats, sheep, chickens or other poultry, etc)
sw: Wanyama wadogo (mbuzi, kondoo, kuku au ndege wengine, nk)

source: A business or shop
sw: biashara au duka

source: Income from wages, salary from job
sw: Mshahara kutoka kazini?

source: Earnings from selling, trading or hawking products?
sw: Mapato kutokana na uuzaji, uchuuzi, biashara au ulanguzi wa bidhaa?

source: Income from rental of property?
sw: Mapato kutokana na kukodisha mali?

source: State old-age (veteran's/civil service) pension*, contributory pension fund, provident fund or social security benefit?
sw: Fao la uzee (mkongwe/mtumishi wa umma) pensheni*, pensheni ya mchangiaji mfuko, mfuko wa hifadhi au faida ya hifadhi ya jamii? mfuko wa msaada kwa jamii (TASAFU)

source: Interest, dividends
sw: Riba, gawio (kwa kwa mfano, kutoka kwa akaunti ya akiba au amana za kudumu)?

source: Money transfers from family members or friends residing inside the country
sw: Pesa kutoka kwa wanafamilia au marafiki wanaoishi ndani ya nchi

source: Money transfers from family members or friends residing outside the country
sw: Pesa kutoka kwa wanafamilia au marafiki wanaoishi nje ya nchi

source: Are you the household head?
sw: Je, wewe ndiyo mkuu wa kaya?

source: Is the household head female or male?
sw: Je, mkuu wa kaya ni mwanamke au mwanaume?

source: How would you describe the household head’s religious orientation?
sw: Je, Mkuu wa kaya ni dini gani?

source: What is the household head’s ethnic background?
sw: Mkuu wa kaya ni kabila gani

source: Highest level of education completed by the household head?
sw: Mkuu wa kaya ana kiwango gani cha elimu?

source: Household head’s employment status
sw: Mkuu wa kaya anajishuhulisha na nini?

source: Household head’s type of employment
sw: Aina ya kazi ya mkuu wa kaya

source: Household head’s marital status
sw: Hali ya ndoa ya mkuu wa kaya

source: Household head’s health insurance and ‘club’ status
sw: Bima ya afya ya mkuu wa kaya na hali ya 'klabu'

source: In what currency do you receive remittances?
sw: Je, unapokea pesa kutoka nje kwa sarafu gani?

source: Outside of this household, how many other people depend on this household’s income?
sw: Nje ya kaya hii, ni watu wangapi wengine wanategemea mapato ya kaya hii?

source: Insert '0' if no dependents other than the members in the household roster
sw: Ingiza 00 ikiwa hakuna wategemezi isipokuwa washiriki katika orodha ya kaya

source: Would you say your household's financial situation is?
sw: Je, unaweza kusema hali ya kifedha ya kaya yako ni?

source: How would you rate your household’s financial situation compared with others in your community?
sw: Je, unaweza kukadiria vipi hali ya kifedha ya kaya yako ikilinganishwa na wengine katika jamii yako?

source: Does your household or any members of the household have current debt or outstanding loans?
sw: Je, kaya yako au mwanakaya yeyote ana deni la mikopo ambalo haijalipwa?

source: What is the approximate total amount of this debt or loan(s)?
sw: Je! ni takriban kiasi gani cha deni au mkopo huu?

source: In local currency
sw: Fedha za ndani

source: How would you describe your religious orientation?
sw: Je, unaweza kuelezeaje mwelekeo wako wa kidini?

source: What is your ethnic background?
sw: Je, wewe ni kabila gani?

source: Highest level of education completed?
sw: Je una Kiwango gani cha juu cha elimu

source: What is your employment status?
sw: Je, unajishuhulisha na nini?

source: What is your type of employment?
sw: Je, ni aina gani ya ajira yako?

source: What is your marital status?
sw: Je, hali yako ya ndoa ikoje

source: What is your health insurance status?
sw: Je unabima ya afya ya aina gani?

source: Do you own any land.
sw: Je, unamiliki ardhi yoyote

source: We want to learn about the household and we use these questions to get an understanding of wealth and opportunities in the community.
sw: Tunataka kufahamu kuhusu kaya na tunatumia maswali haya kupata uelewa wa mali na fursa katika jamii.

source: we mean a person or persons (people/ members) who share the same kitchen (pot), live together, and run the household expenditure from the same income is known as a household
sw: Mtu au watu (watu/washirika) wanaotumia jiko moja (sufuria), wanaoishi pamoja, na kuendesha matumizi ya kaya kutokana na kipato kimoja hujulikana kama ‘kaya’.

source: we mean a person identified on the basis that they shared a place of living together most of time for the past one year
sw: Wanakaya wanapaswa kutambuliwa kwa msingi kwamba waliishi pamoja mara nyingi kwa mwaka mmoja uliopita.

source: When it is difficult to demarcate 'most of the time', living together for the past six months or more should be used to find out whether or not the person is a household member
sw: Wakati ni vigumu kuwekea mipaka 'mara nyingi', kuishi pamoja kwa miezi sita iliyopita au zaidi kunapaswa kutumiwa kujua kama mtu huyo ni mwanakaya au la.

source: <H5><B><font color='orange'>Interviewer to read</font></B></H5>
sw: <H5><B><font color='orange'>Mhoji kusoma</font></B></H5>
