Repository: pypi-data/pypi-mirror-380
Catalog: packages/djangocms-blog/djangocms_blog-2.0.8.tar.gz/djangocms_blog-2.0.8/djangocms_blog/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Images
nl: Afbeeldingen

source: Publish selection
nl: Publiceer selectie

source: Unpublish selection
nl: Maak publicatie selectie ongedaan

source: Enable comments for selection
nl: Sta reacties voor selectie toe

source: Disable comments for selection
nl: Reacties voor selectie uitschakelen

source: Enable liveblog for selection
nl: Activeer liveblog voor selectie

source: Disable liveblog for selection
nl: Schakel liveblog uit voor selectie

source: Generic
nl: Algemeen

source: Notifications
nl: Notificaties

source: You can provide plain strings, Post model attribute or method names
nl: Je kan gewone strings opgeven, een Bericht model attribuut of methode namen

source: application title
nl: applicatie titel

source: object name
nl: object naam

source: blog config
nl: blog configuratie

source: blog configs
nl: blog configuraties

source: untitled
nl: geen titel

source: Post published by default
nl: Berichten standaard publiceren

source: Permalink structure
nl: Permalink opbouw

source: Use placeholder and plugins for article body
nl: Gebruik placeholder en plugins voor de inhoud van het artikel

source: Use abstract field
nl: Gebruik het excerpt veld

source: Set author
nl: Stel auteur in

source: Set author by default
nl: Standaard de auteur instellen

source: Paginate size
nl: Grootte van paginering

source: When paginating list views, how many articles per page?
nl: Wanneer overzichten worden gepagineerd, hoeveel artikelen moeten er dan per pagina getoond worden?

source: Alternative directory to load the blog templates from
nl: Alternatieve map waaruit de blog templates geladen worden

source: Menu structure
nl: Menu opbouw

source: Structure of the django CMS menu
nl: Opbouw van het django CMS menu

source: Show empty categories in menu
nl: Toon lege categorieën in menu

source: Show categories with no post attached in the menu
nl: Toon categorieën zonder artikelen in menu

source: Sitemap changefreq
nl: Verander-frequentie van de Sitemap

source: Changefreq attribute for sitemap items
nl: Verander-frequentie attribuut voor sitemap items

source: Sitemap priority
nl: Sitemap prioriteit

source: Priority attribute for sitemap items
nl: Prioriteit attribuut voor sitemap items

source: Facebook application ID
nl: Facebook applicatie ID

source: Facebook profile ID
nl: Facebook profiel ID

source: Facebook page URL
nl: Facebook pagina URL

source: Facebook author URL
nl: Facebook auteur URL

source: Facebook author
nl: Facebook auteur

source: Twitter author handle
nl: Twitter auteur handle

source: Send notifications on post publish
nl: Stuur melding bij publicatie bericht

source: Emits a desktop notification -if enabled- when publishing a new post
nl: Verstuur desktop notificatie, mits het aan staat, als een nieuw bericht gepubliceerd wordt

source: Send notifications on post update
nl: Stuur meldingen bij update bericht

source: Emits a desktop notification -if enabled- when editing a published post
nl: Verstuur desktop notificatie, mits het aan staat, als een nieuw bericht gewijzigd wordt

source: Post list
nl: Overzicht van Berichten

source: Add post
nl: Bericht toevoegen

source: Edit configuration
nl: Wijzig configuratie

source: Edit Post
nl: Wijzig Bericht

source: Publish {0} now
nl: Publiceer {0} nu

source: New {0}
nl: Nieuwe {0}

source: Create a new {0} in {1}
nl: Maak een nieuwe {0} in {1}

source: Blog articles on %(site_name)s
nl: Blog artikelen op %(site_name)s

source: Liveblog item
nl: Liveblog artikel

source: publish liveblog entry
nl: Publiceer liveblog artikel

source: post date
nl: Post datum

source: liveblog entry
nl: liveblog artikel

source: liveblog entries
nl: liveblog artikelen

source: image
nl: afbeelding

source: thumbnail size
nl: thumbnail afmeting

source: parent
nl: bovenliggende

source: created at
nl: aangemaakt op

source: modified at
nl: gewijzigd op

source: app. config
nl: applicatie configuratie

source: name
nl: naam

source: blog category
nl: blog categorie

source: blog categories
nl: blog categorieën

source: author
nl: auteur

source: created
nl: aangemaakt

source: last modified
nl: laatst gewijzigd

source: published since
nl: gepubliceerd sinds

source: published until
nl: gepubliceerd tot

source: featured date
nl: feature datum

source: publish
nl: publiceer

source: category
nl: categorie

source: main image
nl: hoofd afbeelding

source: main image thumbnail
nl: hoofd afbeelding thumbnail

source: main image full
nl: hoofd afbeelding volledig

source: enable comments on post
nl: sta reacties toe op bericht

source: Select sites in which to show the post. If none is set it will be visible in all the configured sites.
nl: Selecteer sites die het bericht moeten tonen. Als geen site ingesteld wordt, dan is het zichtbaar voor alle geconfigureerde sites.

source: abstract
nl: korte samenvatting

source: post meta description
nl: meta omschrijving van bericht

source: post meta keywords
nl: meta sleutelwoorden van bericht

source: post meta title
nl: meta titel van bericht

source: used in title tag and social sharing
nl: wordt gebruikt in de titel tag en bij het delen via sociale media

source: text
nl: tekst

source: enable liveblog on post
nl: activeer liveblog voor post

source: Related Posts
nl: Gerelateerde artikelen

source: blog article
nl: blog artikel

source: blog articles
nl: blog artikelen

source: current site
nl: huidige site

source: Select items from the current site only
nl: Selecteer alleen items van de huidige site

source: Select plugin template to load for this instance
nl: Selecteer plugin template voor deze instance

source: articles
nl: artikelen

source: The number of latests articles to be displayed.
nl: Het aantal nieuwste berichten om te tonen.

source: filter by tag
nl: filter op tag

source: Show only the blog articles tagged with chosen tags.
nl: Alleen blog artikelen tonen die gekoppeld zijn aan de gekozen tags.

source: filter by category
nl: filter op categorie

source: Show only the blog articles tagged with chosen categories.
nl: Alleen blog artikelen tonen die gekoppeld zijn aan de gekozen categorieën.

source: %s latest articles by tag
nl: %s nieuwste artikelen met tag

source: authors
nl: auteurs

source: The number of author articles to be displayed.
nl: Het aantal artikelen door auteur om te tonen.

source: %s latest articles by author
nl: %s nieuwste artikelen door auteur

source: generic blog plugin
nl: generieke blog plugin

source: Full date
nl: Volledige datum

source: Year / Month
nl: Jaar / Maand

source: Category
nl: Categorie

source: Just slug
nl: Alleen slug

source: Categories and posts
nl: Categorieën en berichten

source: Categories only
nl: Alleen Categorieën

source: Posts only
nl: Alleen Berichten

source: None
nl: Geen

source: always
nl: altijd

source: hourly
nl: elk uur

source: daily
nl: elke dag

source: weekly
nl: elke week

source: monthly
nl: elke maand

source: yearly
nl: elk jaar

source: never
nl: nooit

source: Latest Blog Articles
nl: Nieuwste Blog Artikelen

source: Latest Blog Articles - Cache
nl: Laatste Blog Artikelen - Cache

source: Author Blog Articles
nl: Blog Artikelen Van Auteur

source: Categories
nl: Categorieën

source: Archive
nl: Archief

source: Default template
nl: Standaard template

source: read more
nl: lees verder

source: by
nl: door

source: 1 article
nl: 1 artikel

source: 0 articles
nl: 0 artikelen

source: No article found.
nl: Geen artikelen gevonden.

source: Authors
nl: Auteurs

source: Articles by
nl: Artikelen door

source: No categories found.
nl: Geen categorieën gevonden.

source: Back
nl: Terug

source: previous
nl: vorige

source: Page
nl: Pagina

source: of
nl: van

source: next
nl: volgende
