Repository: pypi-data/pypi-mirror-380
Catalog: packages/Products.MeetingCPASLalouviere/Products.MeetingCPASLalouviere-4.2.1.tar.gz/Products.MeetingCPASLalouviere-4.2.1/src/Products/MeetingCPASLalouviere/locales/*/LC_MESSAGES/PloneMeeting.po
Languages: fr

source: budgetimpactreviewers
fr: correspondants financier

source: config_default_meetingitem_motivation_descr
fr: Définissez ici le texte prédéfini qui sera présent dans le champ 'Motivation de l'urgence' chaque fois qu'un utilisateur crée un nouveau point.

source: directors
fr: directeur

source: icon_help_proposed_to_budget_reviewer
fr: Proposé au correspondant financier

source: reviewers
fr: Président

source: searchproposedtobudgetreviewer
fr: Points proposés au correspondant financier

source: searchproposedton1
fr: Points proposés au N+1

source: searchproposedton2
fr: Points proposés au N+2

source: searchproposedtopresident
fr: Points proposés au Président

source: searchproposedtosecretaire
fr: Points proposés au DG

source: secretaire
fr: Secrétaire
