Repository: pypi-data/pypi-mirror-380
Catalog: packages/django-two-factor-auth/django_two_factor_auth-1.18.1-py3-none-any.whl/two_factor/locale/*/LC_MESSAGES/django.po
Languages: az, ja, sr@latin

source: Method
az: Metod
ja: 何を使いますか？
sr@latin: Metod

source: Token
az: Nişan
ja: トークン

source: Entered token is not valid.
az: Daxil edilmiş nişan yanlışdır.
ja: 入力したトークンは無効です。
sr@latin: Uneti token nije važeći.

source: Yes, I am sure
az: Hə, əminəm
ja: はい、そうです。
sr@latin: Da, siguran sam

source: Don't ask again on this device for %(minutes)i minutes
az: Bu cihazda növbəti %(minutes)i dəqiqə ərzində soruşma
ja: このデバイスで%(minutes)i分間二度と尋ねないでください
sr@latin: Ne pitajte ponovo na ovom uređaju %(minutes)i minuta

source: Don't ask again on this device for %(hours)i hours
az: Bu cihazda növbəti %(hours)i saat ərzində soruşma
ja: このデバイスで%(hours)i時間二度と尋ねないでください
sr@latin: Ne pitajte ponovo na ovom uređaju %(hours)i sati

source: Don't ask again on this device for %(days)i days
az: Bu cihazda növbəti %(days)i gün ərzində soruşma
ja: このデバイスで%(days)i日間二度と尋ねないでください
sr@latin: Ne pitajte ponovo na ovom uređaju %(days)i dana

source: Email address
az: E-poçt ünvanı
sr@latin: Adresa e-pošte

source: Email
az: E-poçt
sr@latin: E-pošta

source: Send email to %s
az: %s ünvanına e-poçt göndər
sr@latin: Pošaljite e-poruku na %s

source: We sent you an email, please enter the token we sent.
az: Sizə e-poçt göndərdik. Zəhmət olmasa, göndərdiyimiz nişanı daxil edin.
sr@latin: Poslali smo vam e-poruku, unesite token koji smo poslali.

source: Phone Number
az: Telefon nömrəsi
ja: 電話番号
sr@latin: Broj telefona

source: Send text message to %s
az: %s nömrəsinə mesaj göndər.
ja: %sにテキストメッセージを送信する
sr@latin: Pošalji tekstualnu poruku na %s

source: Call number %s
az: %s nömrəsinə zəng et
ja: %sに電話する
sr@latin: Pozovi broj %s

source: We sent you a text message, please enter the token we sent.
az: Sizə SMS göndərdik. Zəhmət olmasa, göndərdiyimiz nişanı daxil edin.
sr@latin: Poslali smo vam SMS poruku, unesite token koji smo poslali.

source: We are calling your phone right now, please enter the digits you hear.
az: Telefonunuza zəng edirik. Zəhmət olmasa, eşitdiyiniz rəqəmləri daxil edin.
ja: 現在、電話をかけています。聞こえた数字を入力してください。
sr@latin: Trenutno zovemo vaš telefon, unesite cifre koje čujete.

source: Phone call
az: Telefon zəngi
ja: お電話
sr@latin: Telefonski poziv

source: Text message
az: SMS
ja: メッセージ
sr@latin: SMS poruka

source: Phone Call
az: Telefon Zəngi
ja: お電話
sr@latin: Telefonski poziv

source: Text Message
az: SMS
ja: メッセージ
sr@latin: SMS poruka

source: method
az: metod
ja: 何を使いました。
sr@latin: metod

source: Please enter a valid phone number, including your country code starting with + or 00.
az: + və ya 00 ilə başlayan ölkə kodu da daxil olmaqla düzgün telefon nömrəsi yazın.
ja: +または00で始まる国コードを含む有効な電話番号を入力してください。
sr@latin: Unesite važeći broj telefona, uključujući pozivni broj zemlje koji počinje sa + ili 00.

source: Token generator
az: Nişan yaradıcısı
ja: トークンジェネレーター
sr@latin: Generator tokena

source: Enter the token generated by your token generator
az: Nişan yaradıcınız tərəfindən yaradılan nişanı daxil edin.
sr@latin: Unesite token koji generiše vaš generator tokena

source: Please enter the token generated by your token generator.
az: Zəhmət olmasa, nişan yaradıcınız tərəfindən yaradılan nişanı daxil edin.
sr@latin: Molim unesite token koji generiše vaš generator tokena.

source: WebAuthn Token
az: WebAuthn Nişanı

source: Authenticate using a WebAuthn-compatible device
az: WebAuthn ilə uyğun cihazdan istifadə edərək doğrulayın
sr@latin: Autentifikujte se pomoću uređaja kompatibilnog sa WebAuthn

source: Please use your WebAuthn-compatible device to authenticate.
az: Zəhmət olmasa, doğrulamaq üçün WebAuthn ilə uyğun cihazınızdan istifadə edin.
sr@latin: Koristite svoj uređaj kompatibilan sa WebAuthn za autentifikaciju.

source: The YubiKey could not be verified.
az: YubiKey doğrulana bilmədi.
ja: YubiKeyを検証できませんでした。
sr@latin: YubiKey nije mogao biti verifikovan.

source: Use your Yubikey device
az: Yubikey cihazınızı istifadə edin
sr@latin: Koristite svoj YubiKey uređaj

source: Please use your Yubikey device.
az: Zəhmət olmasa, Yubikey cihazınızı istifadə edin.
sr@latin: Koristite svoj YubiKey uređaj.

source: Cancel
az: İmtina
ja: キャンセル
sr@latin: Otkaži

source: Back
az: Geri
ja: 戻る
sr@latin: Nazad

source: Next
az: Növbəti
ja: 次
sr@latin: Sledeće

source: Backup Tokens
az: Ehtiyat Nişanlar
ja: バックアップトークン
sr@latin: Rezervni tokeni

source: Backup tokens can be used when your primary and backup phone numbers aren't available. The backup tokens below can be used for login verification. If you've used up all your backup tokens, you can generate a new set of backup tokens. Only the backup tokens shown below will be valid.
az: Əsas və ehtiyat telefon nömrələriniz əlçatan olmadıqda ehtiyat nüsxə nişanlarından istifadə edilə bilər. Aşağıdakı ehtiyat nişanları girişin doğrulanması üçün istifadə edilə bilər. Bütün ehtiyat nişanlarınızı istifadə etmisinizsə, yeni ehtiyat nişan dəsti yarada bilərsiniz. Yalnız aşağıda göstərilən ehtiyat nişanları etibarlı olacaq.
ja: バックアップトークンは、メインの電話番号とバックアップの電話番号が利用できない場合に使用できます。 以下のバックアップトークンは、ログインの確認に使用できます。 すべてのバックアップトークンを使い果たした場合は、新しいバックアップトークンのセットを生成できます。 以下に示すバックアップトークンのみが有効になります。
sr@latin: Rezervni tokeni se mogu koristiti kada vaš primarni i rezervni telefonski broj nisu dostupni. Rezervni tokeni u nastavku se mogu koristiti za proveru prijave. Ako ste potrošili sve svoje rezervne tokene, možete da generišete novi skup rezervnih tokena. Važiće samo rezervni tokeni prikazani u nastavku.

source: Print these tokens and keep them somewhere safe.
az: Bu nişanları çap edib, təhlükəsiz bir yerdə saxlayın.
ja: これらのトークンを印刷して、安全な場所に保管してください。
sr@latin: Odštampajte ove tokene i čuvajte ih negde na sigurnom.

source: You don't have any backup codes yet.
az: Hələ heç bir ehtiyat kodunuz yoxdur.
ja: バックアップコードはまだありません。
sr@latin: Još uvek nemate rezervne kodove.

source: Back to Account Security
az: Hesab Təhlükəsizliyinə qayıdın
ja: アカウントのセキュリティに戻る
sr@latin: Nazad na bezbednost naloga

source: Generate Tokens
az: Nişan yarat
ja: トークンを生成する
sr@latin: Generišite tokene

source: Login
az: Daxil ol
ja: ログイン
sr@latin: Prijavite se

source: Enter your credentials.
az: Giriş məlumatlarınızı daxil edin.
ja: 資格情報を入力してください。
sr@latin: Unesite svoje akreditive.

source: Use this form for entering backup tokens for logging in. These tokens have been generated for you to print and keep safe. Please enter one of these backup tokens to login to your account.
az: Giriş üçün ehtiyat nişanları daxil etmək üçün bu formadan istifadə edin. Bu nişanlar çap edilib, təhlükəsiz saxlamaq üçün yaradılıb. Zəhmət olmasa, hesabınıza daxil olmaq üçün bu ehtiyat nişanlardan birini daxil edin.
ja: このフォームを使用して、ログイン用のバックアップトークンを入力します。これらのトークンは、印刷して安全に保管するために生成されています。 アカウントにログインするには、これらのバックアップトークンのいずれかを入力してください。
sr@latin: Koristite ovaj obrazac za unos rezervnih tokena za prijavljivanje. Ovi tokeni su generisani da biste ih odštampali i čuvali. Unesite jedan od ovih rezervnih tokena da biste se prijavili na svoj nalog.

source: Or, alternatively, use one of your other authentication methods:
az: Və ya alternativ olaraq, digər doğrulama üsullarınızdan birini istifadə edin:
sr@latin: Ili, alternativno, koristite jedan od vaših drugih metoda autentifikacije:

source: As a last resort, you can use a backup token:
az: Son çarə olaraq, ehtiyat nişanından istifadə edə bilərsiniz:
ja: 最後の手段として、バックアップトークンを使用できます：
sr@latin: Kao poslednje sredstvo, možete koristiti rezervni token:

source: Use Backup Token
az: Ehtiyat nişandan istifadə et
ja: バックアップトークンを使用する
sr@latin: Koristite rezervni token

source: Permission Denied
az: İcazə verilmədi
ja: アクセス拒否
sr@latin: Dozvola odbijena

source: The page you requested, enforces users to verify using two-factor authentication for security reasons. You need to enable these security features in order to access this page.
az: Sorğu göndərdiyiniz səhifə istifadəçilərə təhlükəsizlik səbəbi ilə iki mərhələli doğrulamadan istifadə etməyi tələb edir. Bu səhifəyə daxil olmaq üçün bu təhlükəsizlik özəlliklərini aktivləşdirməlisiniz.
ja: リクエストしたページでは、セキュリティ上の理由から、ユーザーに二段階認証を使用して確認するように強制しています。 このページにアクセスするには、これらのセキュリティ機能を有効にする必要があります。
sr@latin: Stranica koju ste tražili primorava korisnike da verifikuju korišćenjem dvofaktorske autentifikacije iz bezbednosnih razloga. Morate da omogućite ove bezbednosne funkcije da biste pristupili ovoj stranici.

source: Two-factor authentication is not enabled for your account. Enable two-factor authentication for enhanced account security.
az: Hesabınız üçün iki mərhələli doğrulama aktiv deyil. Qabaqcıl hesab təhlükəsizliyi üçün iki mərhələli doğrulamanı aktivləşdirin.
ja: アカウントで二段階認証が有効になっていません。アカウントのセキュリティを強化するために二段階認証を有効にします。
sr@latin: Dvofaktorska autentifikacija nije omogućena za vaš nalog. Omogućite dvofaktornu autentifikaciju za poboljšanu bezbednost naloga.

source: Go back
az: Geri qayıt
ja: 戻って
sr@latin: Idi nazad

source: Enable Two-Factor Authentication
az: İki Mərhələli Doğrulamanı aç
ja: 二段階認証を有効にする
sr@latin: Omogućite dvofaktorsku autentifikaciju

source: Add Backup Phone
az: Ehtiyyat telefon nömrəsi əlavə et
ja: バックアップ電話を追加する
sr@latin: Dodajte rezervni telefon

source: You'll be adding a backup phone number to your account. This number will be used if your primary method of registration is not available.
az: Hesabınıza ehtiyat telefon nömrəsi əlavə edəcəksiniz. Əsas qeydiyyat metodunuz əlçatan olmadıqda bu nömrə istifadə olunacaq.
ja: アカウントに予備の電話番号を追加します。 この番号は、主要な登録方法が利用できない場合に使用されます。
sr@latin: Na nalog ćete dodati rezervni broj telefona. Ovaj broj će se koristiti ako vaš primarni metod registracije nije dostupan.

source: We've sent a token to your phone number. Please enter the token you've received.
az: Telefon nömrənizə nişan göndərdik. Zəhmət olmasa, aldığınız nişanı daxil edin.
ja: 電話番号にトークンを送信しました。 受け取ったトークンを入力してください。
sr@latin: Poslali smo token na vaš broj telefona. Unesite token koji ste primili.

source: You are about to take your account security to the next level. Follow the steps in this wizard to enable two-factor authentication.
az: Hesabınızın təhlükəsizliyini növbəti səviyyəyə keçirmək üzrəsiniz. İki mərhələli doğrulamanı aktivləşdirmək üçün bu yardıçıdakı addımları izləyin.
ja: アカウントのセキュリティを次のレベルに引き上げようとしています。 このウィザードの手順に従って、二段階認証を有効にします。
sr@latin: Spremate se da podignete bezbednost svog naloga na viši nivo. Pratite korake u ovom čarobnjaku da biste omogućili dvofaktorsku autentifikaciju.

source: Please select which authentication method you would like to use.
az: Hansı doğrulama metodundan istifadə etmək istədiyinizi seçin.
ja: 使用する認証方法を選択してください。
sr@latin: Izaberite koji metod autentifikacije želite da koristite.

source: To start using a token generator, please use your smartphone to scan the QR code below. For example, use Google Authenticator.
az: Nişan yaradıcısından istifadə etməyə başlamaq üçün ağıllı telefonunuzla aşağıdakı QR kodu oxudun. Məsələn, Google Authenticator-dan istifadə edin.
sr@latin: Da biste počeli da koristite generator tokena, koristite svoj pametni telefon da skenirate Kju-ar (QR) kod ispod. Na primer, koristite Google Authentikator.

source: Alternatively you can use the following secret to setup TOTP in your authenticator or password manager manually.
az: Alternativ olaraq, doğrulayıcınızda və ya şifrə idarəçinizdə TOTP-ni əl ilə qurmaq üçün aşağıdakı məxfi sözdən istifadə edə bilərsiniz.
sr@latin: Alternativno, možete koristiti sledeću tajnu za ručno podešavanje TOTP-a u autentifikatoru ili menadžeru lozinki.

source: TOTP Secret:
az: TOTP Şifrəsi:
sr@latin: TOTP tajna:

source: Then, enter the token generated by the app.
az: Daha sonra, tətbiq tərəfindən yaradılan nişanı daxil edin.
sr@latin: Zatim unesite token koji je generisala aplikacija.

source: Please enter the phone number you wish to receive the text messages on. This number will be validated in the next step.
az: Zəhmət olmasa, mətn mesajlarının göndərilməsini istədiyiniz telefon nömrəsini daxil edin. Bu nömrə növbəti mərhələdə təsdiqlənəcək.
ja: テキストメッセージを受信したい電話番号を入力してください。 この番号は次のステップで検証されます。
sr@latin: Unesite broj telefona na koji želite da primate SMS poruke. Ovaj broj će biti potvrđen u sledećem koraku.

source: Please enter the phone number you wish to be called on. This number will be validated in the next step.
az: Zəhmət olmasa, zəng olunmasını istədiyiniz telefon nömrəsini daxil edin. Bu nömrə növbəti mərhələdə təsdiqlənəcək.
ja: 電話をかけたい電話番号を入力してください。 この番号は次のステップで検証されます。
sr@latin: Unesite broj telefona na koji želite da vas pozovu. Ovaj broj će biti potvrđen u sledećem koraku.

source: We sent you a text message, please enter the tokens we sent.
az: Sizə SMS göndərdik. Zəhmət olmasa, göndərdiyimiz nişanları daxil edin.
ja: テキストメッセージを送信しました。送信したトークンを入力してください。
sr@latin: Poslali smo vam SMS poruku, unesite tokene koje smo poslali.

source: We've encountered an issue with the selected authentication method. Please go back and verify that you entered your information correctly, try again, or use a different authentication method instead. If the issue persists, contact the site administrator.
az: Seçilmiş doğrulama metodu ilə bağlı problemlə qarşılaşdıq. Zəhmət olmasa, geri qayıdın və məlumatınızı düzgün daxil etdiyinizi yoxlayıb, yenidən cəhd edin və ya əvəzinə başqa doğrulama metodundan istifadə edin. Problem davam edərsə, sayt inzibatçısı ilə əlaqə saxlayın.
ja: 選択した認証方法で問題が発生しました。 戻って情報を正しく入力したことを確認するか、再試行するか、代わりに別の認証方法を使用してください。 問題が解決しない場合は、サイト管理者に連絡してください。
sr@latin: Naišli smo na problem sa izabranom metodom autentifikacije. Vratite se i proverite da li ste ispravno uneli svoje podatke, pokušajte ponovo ili umesto toga koristite drugi metod autentifikacije. Ako se problem i dalje javlja, kontaktirajte administratora sajta.

source: To identify and verify your YubiKey, please insert a token in the field below. Your YubiKey will be linked to your account.
az: "YubiKey"inizi müəyyən etmək və doğrulamaq üçün zəhmət olmasa, aşağıdakı sahəyə giriş nişanı daxil edin. "YubiKey"iniz hesabınızla əlaqələndiriləcək.
ja: YubiKeyを識別して確認するには、下のフィールドにトークンを挿入してください。YubiKeyはあなたのアカウントにリンクされます。
sr@latin: Da biste identifikovali i verifikovali svoj YubiKey, unesite token u polje ispod. Vaš YubiKey će biti povezan sa vašim nalogom.

source: Congratulations, you've successfully enabled two-factor authentication.
az: Təbriklər. Siz uğurla iki mərhələli doğrulamanı aktivləşdirdiniz.
ja: おめでとうございます。2要素認証が正常に有効になりました。
sr@latin: Čestitamo, uspešno ste omogućili dvofaktorsku autentifikaciju.

source: However, it might happen that you don't have access to your primary token device. To enable account recovery, add a phone number.
az: Bununla belə, elə ola bilər ki, əsas nişan cihazınıza əlçatımlılığınız olmasın. Hesabın bərpasını aktivləşdirmək üçün telefon nömrəsi əlavə edin.
ja: プライマリトークンデバイスにアクセスできない場合があります。 アカウントの復旧を有効にするには、電話番号を追加します。
sr@latin: Međutim, može se desiti da nemate pristup svom primarnom token uređaju. Da biste omogućili oporavak naloga, dodajte broj telefona.

source: Add Phone Number
az: Telefon nömrəsi əlavə et
ja: 電話番号を追加
sr@latin: Dodajte broj telefona

source: Disable Two-factor Authentication
az: İki Mərhələli Doğrulamanı söndür
ja: 二段階認証を無効にする
sr@latin: Onemogućite dvofaktorsku autentifikaciju

source: You are about to disable two-factor authentication. This weakens your account security, are you sure?
az: İki mərhələli doğrulamanı söndürmək üzrəsiniz. Bu, hesabınızın təhlükəsizliyini zəiflədir. Davam etmək istədiyinizə əminsiniz?
ja: 2要素認証を無効にしようとしています。 これはアカウントのセキュリティを弱めます、本当に確かですか？
sr@latin: Spremate se da onemogućite dvofaktorsku autentifikaciju. Ovo slabi bezbednost vašeg naloga, da li ste sigurni?

source: Disable
az: Söndür
ja: 無効
sr@latin: Onemogući

source: Account Security
az: Hesab Təhlükəsizliyi
ja: アカウントのセキュリティ
sr@latin: Bezbednost naloga

source: Primary method: %(primary)s
az: Əsas metod: %(primary)s
ja: 主な方法：%(primary)s
sr@latin: Primarni metod: %(primary)s

source: Backup Phone Numbers
az: Ehtiyat telefon nömrəsi
ja: バックアップ電話番号
sr@latin: Rezervni brojevi telefona

source: If your primary method is not available, we are able to send backup tokens to the phone numbers listed below.
az: Əgər əsas metodunuz əlçatan deyilsə, biz aşağıda sadalanan telefon nömrələrinə ehtiyat nişanları göndərə bilərik.
ja: 主な方法が利用できない場合は、以下の電話番号にバックアップトークンを送信できます。
sr@latin: Ako vaš primarni metod nije dostupan, možemo da vam pošaljemo rezervne tokene na dole navedene brojeve telefona.

source: Are you sure?
az: Əminsiniz?
sr@latin: Da li ste sigurni?

source: Unregister
az: Qeydiyyatdan çıxart
ja: 登録解除
sr@latin: Poništi registraciju

source: If you don't have any device with you, you can access your account using backup tokens.
az: Əgər yanınızda heç bir cihaz yoxdursa, ehtiyat nüsxə nişanlarından istifadə edərək hesabınıza daxil ola bilərsiniz.
ja: デバイスをお持ちでない場合は、バックアップトークンを使用してアカウントにアクセスできます。
sr@latin: Ako nemate nijedan uređaj sa sobom, možete pristupiti svom nalogu pomoću rezervnih tokena.

source: You have only one backup token remaining.
az: Yalnız bir ehtiyat nişanınız qalıb.
ja: バックアップトークンが%(counter)s個残っています。
sr@latin: Imate samo jedan preostali rezervni token.

source: Show Codes
az: Kodları göstər
ja: コードを表示
sr@latin: Prikaži kodove

source: Disable Two-Factor Authentication
az: İki Mərhələli Doğrulamanı söndür
ja: 二段階認証を無効にする
sr@latin: Onemogućite dvofaktorsku autentifikaciju

source: However we strongly discourage you to do so, you can also disable two-factor authentication for your account.
az: Bununla belə, sizi qəti şəkildə buna çəkindiririk. Siz həmçinin hesabınız üçün iki mərhələli doğrulamanı söndürə bilərsiniz.
ja: そうすることは強くお勧めしません。アカウントの二段階認証を無効にすることもできます。
sr@latin: Ipak strogo ne preporučujemo da to uradite, takođe možete da onemogućite dvofaktorsku autentifikaciju za svoj nalog.

source: Your OTP token is %(token)s
az: Tək istifadəlik kodunuz: %(token)s
ja: あなたのOTPトークンは%(token)sです
sr@latin: Vaš OTP token je %(token)s

source: Your session has timed out. Please login again.
az: Seansınızın vaxtı bitib. Zəhmət olmasa, bir də giriş edin.
ja: あなたのセッションは時間切れです。 もう一度ログインしてください。
sr@latin: Vaša sesija je istekla. Molimo prijavite se ponovo.

source: ManagementForm data is missing or has been tampered with
az: ManagementForm məlumatları yoxdur və ya dəyişdirilib
ja: マネジメントフォームのデータが見つからないか、改竄されています。
sr@latin: ManagementForm podaci nedostaju ili su bili manipulisani

# twilio_locale
source: en
ja: ja-JP
